mongo_metrics/modified_run_e_mongo_threads_016_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 16 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 5683
[OVERALL], Throughput(ops/sec), 175.96339961288052
[TOTAL_GCS_G1_Young_Generation], Count, 2
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.42231215907091324
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 2
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 0.42231215907091324
[READ], Operations, 46
[READ], AverageLatency(us), 24347.369565217392
[READ], MinLatency(us), 787
[READ], MaxLatency(us), 49343
[READ], 95thPercentileLatency(us), 43807
[READ], 99thPercentileLatency(us), 49343
[READ], Return=OK, 46
[SCAN-FAILED], Operations, 609
[SCAN-FAILED], AverageLatency(us), 88750.16091954023
[SCAN-FAILED], MinLatency(us), 17088
[SCAN-FAILED], MaxLatency(us), 200319
[SCAN-FAILED], 95thPercentileLatency(us), 136959
[SCAN-FAILED], 99thPercentileLatency(us), 162815
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 137.3125
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 2181
[CLEANUP], 95thPercentileLatency(us), 4
[CLEANUP], 99thPercentileLatency(us), 2181
[SCAN], Operations, 345
[SCAN], AverageLatency(us), 80313.28695652174
[SCAN], MinLatency(us), 6104
[SCAN], MaxLatency(us), 175615
[SCAN], 95thPercentileLatency(us), 131583
[SCAN], 99thPercentileLatency(us), 164735
[SCAN], Return=OK, 345
[SCAN], Return=ERROR, 609