mongo_metrics/modified_run_e_mongo_threads_128_operations_15585.dat
//bin/java  -classpath /home/rustam/IdeaProjects/YCSB-JSON-III/conf:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/core-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/HdrHistogram-2.1.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/mongodb-binding-0.18.0-SNAPSHOT.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-annotations-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-core-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/jackson-databind-2.15.2.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/json-simple-1.1.1.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-classic-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/logback-core-1.2.11.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/mongo-java-driver-3.11.0.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/slf4j-api-1.7.25.jar:/home/rustam/IdeaProjects/YCSB-JSON-III/mongodb/target/dependency/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -P workloads/workloade -threads 128 -p recordcount=15585 -p mongodb.url=mongodb://localhost:27017/ycsb?w=0
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 5557
[OVERALL], Throughput(ops/sec), 179.95321216483714
[TOTAL_GCS_G1_Young_Generation], Count, 3
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 101
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.8175274428648551
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 3
[TOTAL_GC_TIME], Time(ms), 101
[TOTAL_GC_TIME_%], Time(%), 1.8175274428648551
[READ], Operations, 67
[READ], AverageLatency(us), 287072.0
[READ], MinLatency(us), 67648
[READ], MaxLatency(us), 636415
[READ], 95thPercentileLatency(us), 571903
[READ], 99thPercentileLatency(us), 620543
[READ], Return=OK, 67
[SCAN-FAILED], Operations, 614
[SCAN-FAILED], AverageLatency(us), 648126.6970684039
[SCAN-FAILED], MinLatency(us), 33344
[SCAN-FAILED], MaxLatency(us), 1242111
[SCAN-FAILED], 95thPercentileLatency(us), 1000447
[SCAN-FAILED], 99thPercentileLatency(us), 1131519
[CLEANUP], Operations, 128
[CLEANUP], AverageLatency(us), 37.4296875
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 4719
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 3
[SCAN], Operations, 319
[SCAN], AverageLatency(us), 614781.6927899687
[SCAN], MinLatency(us), 37696
[SCAN], MaxLatency(us), 1182719
[SCAN], 95thPercentileLatency(us), 1030655
[SCAN], 99thPercentileLatency(us), 1144831
[SCAN], Return=OK, 319
[SCAN], Return=ERROR, 614